packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(unpin! doom-themes)

(package! ace-window :pin "77115afc1b0b9f633084cf7479c767988106c196")
