config.org
** Group tabs by projectile project
#+begin_src elisp :tangle config.el
(require 'centaur-tabs)
(centaur-tabs-group-by-projectile-project)
#+end_src

** Show tab index and count
#+begin_src elisp :tangle config.el
(setq centaur-tabs-show-count t)
#+end_src

** Disable tabs for specific buffers
#+begin_src elisp :tangle config.el
(add-hook! '(ibuffer-mode-hook
             org-agenda-mode-hook
             dired-mode-hook
             ranger-mode-hook) #'centaur-tabs-local-mode)
#+end_src

** Gray out non focused buffer icons
#+begin_src elisp :tangle config.el
(setq centaur-tabs-gray-out-icons 'buffer)
#+end_src

* Editor

** Enable autosave
#+begin_src elisp :tangle config.el
(setq auto-save-default t)
#+end_src

** Auto backup files
#+begin_src elisp :tangle config.el
(setq make-backup-files t)
#+end_src

** Set default tab-width
#+begin_src elisp :tangle config.el
(setq-default tab-width 4)
#+end_src

** Relative numbers
#+begin_src elisp :tangle config.el
(setq display-line-numbers-type 'visual)
#+end_src

** Set scroll margin
#+begin_src elisp :tangle config.el
(setq scroll-margin 5)
#+end_src

** Disable final newline in files
#+begin_src elisp :tangle config.el
(setq require-final-newline nil)
#+end_src

* Ranger
#+begin_src elisp :tangle config.el
(ranger-override-dired-mode t)
(setq ranger-show-hidden t
      ranger-hide-cursor t
      ranger-excluded-extensions '("mkv" "iso" "mp4" "bin" "exe" "msi"))
#+end_src

* Evil

** Set up evil packages
#+begin_src elisp :tangle packages.el
(package! evil-commentary)
(package! evil-snipe :disable t)
#+end_src

** Fine Undo
#+begin_src elisp :tangle config.el
(setq evil-want-fine-undo t)
#+end_src

** Split windows so that right/down is focused after the split
#+begin_src elisp :tangle config.el
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

** Show buffer prompt upon window split
#+begin_src elisp :tangle config.el
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-project-buffer))
#+end_src

** Line up Y behavior to other operators
#+begin_src elisp :tangle config.el
(setq evil-want-Y-yank-to-eol t)
#+end_src

** Don't continue comments on o/O, creating empty lines
#+begin_src elisp :tangle config.el
(setq +evil-want-o/O-to-continue-comments nil)
#+end_src

** Changed text doesn't go into clipboard
#+begin_src elisp :tangle config.el
(defun schrenker/evil-change (orig-fn beg end &optional type _ &rest args)
    (apply orig-fn beg end type ?_ args))
(advice-add 'evil-change :around 'schrenker/evil-change)
#+end_src

** Visual mode changes don't go into clipboard
#+begin_src elisp :tangle config.el
(setq evil-kill-on-visual-paste nil)
#+end_src

** Substitute global by default
#+begin_src elisp :tangle config.el
(setq evil-ex-substitute-global t)
#+end_src

** Disable escape on "jk"
#+begin_src elisp :tangle config.el
(setq evil-escape-key-sequence nil)
#+end_src

** Evil Window Map
#+begin_src elisp :tangle config.el
(map! :map evil-window-map
      :g "w" #'ace-window
      :g "p" #'treemacs-select-window)
#+end_src

** Enable key-chord and make double tap ';' move cursor to the right in insert mode
#+begin_src elisp :tangle packages.el
(package! key-chord)
#+end_src

#+begin_src elisp :tangle config.el
(require 'key-chord)

(key-chord-define evil-insert-state-map ";;" 'right-char)
(key-chord-mode 1)
#+end_src

** Disable evil keybindings for git-timemachine
#+begin_src elisp :tangle config.el
(with-eval-after-load 'git-timemachine
  (evil-make-overriding-map git-timemachine-mode-map 'normal)
  (add-hook 'git-timemachine-mode-hook #'evil-normalize-keymaps))
#+end_src

* Eshell
#+begin_src emacs-lisp :tangle config.el
(remove-hook! 'eshell-mode-hook #'hide-mode-line-mode)
(add-hook! 'eshell-mode-hook
  (unless (s-contains? "popup" (buffer-name))
    (rename-buffer (concat "Esh:" (projectile-project-name)) t)))
;;Fix for doom/reload problem
(advice-add 'eshell-did-you-mean-output-filter :around #'fail-silently-advice)
(setq bash-completion-enabled nil)
#+end_src

* Magit

** Smerge repeatedly (thanks tecosaur)
#+begin_src elisp :tangle config.el
(defun smerge-repeatedly ()
  "Perform smerge actions again and again"
  (interactive)
  (smerge-mode 1)
  (smerge-transient))
(after! transient
  (transient-define-prefix smerge-transient ()
    [["Move"
      ("n" "next" (lambda () (interactive) (ignore-errors (smerge-next)) (smerge-repeatedly)))
      ("p" "previous" (lambda () (interactive) (ignore-errors (smerge-prev)) (smerge-repeatedly)))]
     ["Keep"
      ("b" "base" (lambda () (interactive) (ignore-errors (smerge-keep-base)) (smerge-repeatedly)))
      ("u" "upper" (lambda () (interactive) (ignore-errors (smerge-keep-upper)) (smerge-repeatedly)))
      ("l" "lower" (lambda () (interactive) (ignore-errors (smerge-keep-lower)) (smerge-repeatedly)))
      ("a" "all" (lambda () (interactive) (ignore-errors (smerge-keep-all)) (smerge-repeatedly)))
      ("RET" "current" (lambda () (interactive) (ignore-errors (smerge-keep-current)) (smerge-repeatedly)))]
     ["Diff"
      ("<" "upper/base" (lambda () (interactive) (ignore-errors (smerge-diff-base-upper)) (smerge-repeatedly)))
      ("=" "upper/lower" (lambda () (interactive) (ignore-errors (smerge-diff-upper-lower)) (smerge-repeatedly)))
      (">" "base/lower" (lambda () (interactive) (ignore-errors (smerge-diff-base-lower)) (smerge-repeatedly)))
      ("R" "refine" (lambda () (interactive) (ignore-errors (smerge-refine)) (smerge-repeatedly)))
      ("E" "ediff" (lambda () (interactive) (ignore-errors (smerge-ediff)) (smerge-repeatedly)))]
     ["Other"
      ("c" "combine" (lambda () (interactive) (ignore-errors (smerge-combine-with-next)) (smerge-repeatedly)))
      ("r" "resolve" (lambda () (interactive) (ignore-errors (smerge-resolve)) (smerge-repeatedly)))
      ("k" "kill current" (lambda () (interactive) (ignore-errors (smerge-kill-current)) (smerge-repeatedly)))
      ("q" "quit" (lambda () (interactive) (smerge-auto-leave)))]]))
#+end_src

* Org mode
#+begin_src elisp :tangle config.el
(setq org-startup-folded 'nofold)
#+end_src

** Update dynamic blocks on save
#+begin_src elisp :tangle config.el
(after! org
  (add-hook 'before-save-hook
            (lambda ()
              (unless (and (boundp 'org-capture-mode) org-capture-mode)
                (org-update-all-dblocks)))))
#+end_src

** Format org mode buffer on save
#+begin_src elisp :tangle config.el
(add-hook! 'org-mode-hook (org-format-on-save-mode 1))
#+end_src

** Org-mode-map
#+begin_src elisp :tangle config.el
(map! :map org-mode-map
      :localleader "$" #'org-decrypt-entry
      :localleader "a i" #'org-display-inline-images)
#+end_src

** Set visual line movement via gj and gk
#+begin_src elisp :tangle config.el
(after! org
  (map! :map org-mode-map
        :nv "gj" #'evil-next-visual-line
        :nv "gk" #'evil-previous-visual-line))
#+end_src

** Set up path for org mode
#+begin_src elisp :tangle config.el
(setq org-directory "~/org"
      org-roam-directory org-directory
      org-archive-location "archive/%s_archive::"
      org-default-notes-file (concat org-directory "/20221222131538-personal.org")
      +org-capture-notes-file org-default-notes-file)
#+end_src

** Exclude certain tags from inheritance
#+begin_src elisp :tangle config.el
(setq org-tags-exclude-from-inheritance '("crypt"
                                          "moc"
                                          "inbox"))
#+end_src

** Set up headline encryption
#+begin_src elisp :tangle config.el
(require 'org-crypt)

(setq org-crypt-disable-auto-save t
      org-crypt-key (rot13 "fronfgvna@mnjnqmxv.grpu"))
#+end_src

** Disable electric indent
#+begin_src elisp :tangle config.el
(add-hook! org-mode (electric-indent-local-mode -1))
#+end_src

** Org kanban
#+begin_src elisp :tangle packages.el
(package! org-kanban)
#+end_src

** Org appear
#+begin_src elisp :tangle packages.el
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src

#+begin_src elisp :tangle config.el
(add-hook 'org-mode-hook 'org-appear-mode)
#+end_src

** Inline images
#+begin_src elisp :tangle config.el
(setq org-display-remote-inline-images t
      org-startup-with-inline-images t
      org-image-actual-width nil)
#+end_src

** Log time of done tasks
#+begin_src elisp :tangle config.el
(setq org-log-done 'time)
#+end_src

** Task status and prioritization
#+begin_src elisp :tangle config.el
(after! org
  (setq
   org-crypt-disable-auto-save t
   org-priority-highest '?A
   org-priority-lowest  '?C
   org-priority-default '?C
   org-priority-start-cycle-with-default t
   org-priority-faces '((?A :foreground "#FF6C6B" :weight normal)
                        (?B :foreground "#ECBE7B" :weight normal)
                        (?C :foreground "#51AFEF" :weight normal))
   org-todo-keywords '((sequence "TODO(t)" "INPROGRESS(i!)" "BLOCKED(b@/!)" "ONHOLD(o@/!)" "REVIEW(r!)" "|" "DONE(d/@)" "DELEGATED(e@/@)" "CANCELLED(c@/@)"))
   org-todo-keyword-faces
   '(("TODO" :foreground "#8741bb" :weight bold :inverse-video t)
     ("INPROGRESS" :foreground "#98BE65" :weight bold :inverse-video t)
     ("BLOCKED" :foreground "#DA8548" :weight bold :inverse-video t)
     ("ONHOLD" :foreground "#2AA198" :weight bold :inverse-video t)
     ("REVIEW" :foreground "#00BFFF" :weight bold :inverse-video t)
     ("DONE" :foreground "#9FA4BB" :weight bold :inverse-video t )
     ("CANCELLED" :foreground "#574C58" :weight bold :inverse-video t)
     ("DELEGATED"  :foreground "#6c71c4" :weight bold :inverse-video t))))

#+end_src

** Drawer for state changes
#+begin_src elisp :tangle config.el
(setq org-log-into-drawer "LOGBOOK")
#+end_src

** Headlines
#+begin_src elisp :tangle config.el
(setq org-superstar-headline-bullets-list '("⁖"))

(after! org
  (custom-set-faces!
    '(org-level-1 :height 1.04 :inherit outline-1)
    '(org-level-2 :height 1.04 :inherit outline-2)
    '(org-level-3 :height 1.04 :inherit outline-3)
    '(org-level-4 :height 1.04 :inherit outline-4)
    '(org-level-5 :height 1.04 :inherit outline-5)
    '(org-level-6 :height 1.04 :inherit outline-6)
    '(org-level-7 :height 1.04 :inherit outline-7)
    '(org-level-8 :height 1.04 :inherit outline-8)))
#+end_src

** Bullet points
#+begin_src elisp :tangle config.el
(setq org-superstar-prettify-item-bullets nil)

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◆"))))))
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([+]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◇"))))))
#+end_src

** Demote bullet points
#+begin_src elisp :tangle config.el
(setq org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("1." . "a.")))
#+end_src

** Fancy priorities
#+begin_src elisp :tangle config.el
(after! org-fancy-priorities
  (setq
   org-fancy-priorities-list '((65 . "⁂")
                               (66 . "⁑")
                               (67 . "⁕"))))
#+end_src

** Move tags to the far right
#+begin_src elisp :tangle config.el
(after! org
  (setq org-tags-column -77))
#+end_src

** Enable word-wrap
#+begin_src elisp :tangle config.el
(add-hook 'org-mode-hook #'+word-wrap-mode)
#+end_src

** Visual line mode
#+begin_src elisp :tangle config.el
(add-hook 'org-mode-hook #'visual-line-mode)
#+end_src

** Emphasis markers
#+begin_src elisp :tangle config.el
(setq org-hide-emphasis-markers t)
#+end_src

** Agenda holidays
#+begin_src elisp :tangle packages.el
(package! polish-holidays :recipe (:host github :repo "mikolajb/emacs-polish-holidays"))
(package! german-holidays)
#+end_src

#+begin_src elisp :tangle config.el
(require 'polish-holidays)
(require 'german-holidays)

  (use-package! holidays
    :after org-agenda
    :config
    (setq calendar-holidays
          (append '((holiday-fixed 1 1 "New Year's Day")
                    (holiday-fixed 2 14 "Valentine's Day")
                    (holiday-fixed 4 1 "April Fools' Day")
                    (holiday-fixed 10 31 "Halloween")
                    (holiday-easter-etc)
                    (holiday-fixed 12 25 "Christmas")
                    (solar-equinoxes-solstices))
                  ustawowo-wolne-od-pracy
                  czas-letni
                  swieta-panstwowe-pozostałe-święta
                  holiday-german-holidays)))
#+end_src

** Roam

*** Org roam keybinds
#+begin_src elisp :tangle config.el
(map! :map doom-leader-notes-map
      :g "r t" #'org-roam-ui-sync-theme
      :g "r o" #'org-roam-ui-open)
#+end_src

*** Org-roam-ui
#+begin_src elisp :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

*** Default template
#+begin_src elisp :tangle config.el
(setq org-roam-capture-templates '(("d" "default" plain "%?"
                                      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: showeverything\n#+date: %U\n#+modified: \n#+filetags: :inbox:\n\n")
                                      :immediate-finish t)))
#+end_src

** Record last modified date in org-mode
#+begin_src elisp :tangle config.el
(after! org
  (setq time-stamp-active t
        time-stamp-start "#\\+modified: [ \t]*"
        time-stamp-end "$"
        time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
  (add-hook 'before-save-hook 'time-stamp))
#+end_src

** Org capture templates
#+begin_src elisp :tangle config.el
(after! org
  (setq org-capture-templates
        '(
          ("p" "Personal Note" entry (file+headline org-default-notes-file "Notes")
           "** %U\n%i%?" :empty-lines 1)
          ("P" "Personal Task" entry (file+olp org-default-notes-file "Tasks" "Backlog")
           "** TODO %?\n%U" :empty-lines 1)
          )))
#+end_src

** Org capture anywhere MacOS
#+begin_src elisp :tangle packages.el
(package! noflet)
#+end_src

#+begin_src elisp :tangle config.el
(require 'noflet)
(defun schrenker/make-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (make-frame '((name . "capture")
                (top . 300)
                (left . 700)
                (width . 80)
                (height . 25)))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
          (org-capture)))

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))
#+end_src

** Org autolist
#+begin_src elisp :tangle packages.el
(package! org-autolist)
#+end_src

#+begin_src elisp :tangle config.el
(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))
#+end_src

* Treemacs

** Treemacs git mode
#+begin_src elisp :tangle config.el
(setq +treemacs-git-mode 'deferred)
#+end_src

** Treemacs popup rule
#+begin_src elisp :tangle config.el
(set-popup-rule! "^ \\*Treemacs-Scoped-Buffer-Perspective [^*]*\\*" :ignore t)
#+end_src

** Treemacs modes
#+begin_src elisp :tangle config.el
(setq treemacs-follow-mode t)
#+end_src

