config.org
** Pull all the icons for treemacs
#+begin_src elisp :tangle packages.el
(package! treemacs-all-the-icons)
#+end_src

** Set treemacs themes
#+begin_src elisp :tangle config.el
(require 'treemacs-all-the-icons)
(treemacs-load-theme "all-the-icons")

(setq doom-themes-treemacs-theme "doom-colors")
#+end_src

* Corfu
#+begin_src elisp :tangle config.el
(setq corfu-preview-current 'insert
      corfu-preselect 'prompt ;; Disable candidate preselection
      corfu-on-exact-match nil
      corfu-excluded-modes
      '(erc-mode
        circe-mode
        help-mode
        gud-mode))
#+end_src

** TNG keymap
#+begin_src elisp :tangle config.el
    (map! ;;:desc "complete" "TAB" #'completion-at-point
     :map corfu-map
     :desc "next" "TAB" #'corfu-next
     :desc "next" "<tab>" #'corfu-next
     :desc "next" [tab] #'corfu-next
     :desc "previous" "S-TAB" #'corfu-previous
     :desc "previous" "<backtab>"  #'corfu-previous
     :desc "previous" [backtab] #'corfu-previous)
#+end_src

** Global corfu mode
#+begin_src elisp :tangle config.el
(global-corfu-mode)
#+end_src

** Remove company remnants
#+begin_src elisp :tangle config.el
(setq +lsp-company-backends nil
      +vertico-company-completion-styles nil)
#+end_src

** Orderless
#+begin_src elisp :tangle config.el
(after! corfu
  (require 'orderless)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles basic partial-completion)))
        orderless-matching-styles '(orderless-literal
                                    orderless-regexp
                                    orderless-prefixes
                                    orderless-initialism)))
#+end_src

* Eat
#+begin_src emacs-lisp :tangle packages.el
(package! eat :recipe (:host codeberg
                       :repo "akib/emacs-eat"
                       :files ("*.el" ("term" "term/*.el") "*.texi"
                               "*.ti" ("terminfo/e" "terminfo/e/*")
                               ("terminfo/65" "terminfo/65/*")
                               ("integration" "integration/*")
                               (:exclude ".dir-locals.el" "*-tests.el"))))
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq eat-term-name "xterm-256color")
;; For `eat-eshell-mode'.
(add-hook 'eshell-load-hook #'eat-eshell-mode)
#+end_src

* Flyspell
#+begin_src elisp :tangle config.el
(after! flyspell
  (setq flyspell-lazy-idle-seconds 2))
#+end_src

* Cheat.sh
#+begin_src elisp :tangle packages.el
(package! cheat-sh)
#+end_src

* Inheritenv
#+begin_src elisp :tangle packages.el
(package! inheritenv)
#+end_src

#+begin_src elisp :tangle config.el
(require 'inheritenv)
(inheritenv-add-advice #'with-temp-buffer)
#+end_src

* Dired
#+begin_src elisp :tangle config.el
(map! :map dired-mode-map
      :n "h" #'dired-up-directory
      :n "l" #'dired-find-alternate-file)
#+end_src

* x509 mode
#+begin_src elisp :tangle packages.el
(package! x509-mode)
#+end_src

#+begin_src elisp :tangle config.el
(setq x509-openssl-cmd "/opt/homebrew/Cellar/openssl@3/3.0.5/bin/openssl" )
#+end_src

* Confluence
#+begin_src elisp :tangle packages.el
(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))
#+end_src

* Kubernetes

** Kele
#+begin_src elisp :tangle packages.el
(package! kele)
#+end_src

* Yasnippets
- disable globally, enable locally
#+begin_src elisp :tangle config.el
(yas-global-mode -1)
(yas-reload-all)
(add-hook! 'org-mode-hook (yas-minor-mode))
#+end_src

# * Prism
# #+begin_src elisp :tangle packages.el
# (package! prism)
# #+end_src

# #+begin_src elisp :tangle config.el
# (fset 'rainbow-delimiters-mode #'prism-mode)

# (defun schrenker/prism-set-colors ()
#     (prism-set-colors
#       :desaturations '(0) ; do not change---may lower the contrast ratio
#       :lightens '(0)      ; same
#       :colors (list
#                (doom-color 'blue)
#                (doom-color 'violet)
#                (doom-color 'yellow)
#                (doom-color 'cyan)
#                (doom-color 'green)))
#     (message "Prism colors set."))

# (use-package! prism
#   :commands prism-mode
#   :init
#   (add-hook! '(json-mode-hook prog-mode-hook)
#     (unless (derived-mode-p 'sh-mode 'python-mode)
#       (prism-mode 1)))

#   ;; (add-hook! '(yaml-mode-hook sh-mode-hook python-mode-hook fish-mode-hook)
#   ;;   (prism-whitespace-mode 1))



#   :config
#   (after! doom-themes
#     (setq prism-comments nil)
#      ;; prism-num-faces 5
#      ;; prism-whitespace-mode-indents '((python-mode . python-indent-offset)
#      ;;                                 (haskell-mode . haskell-indentation-left-offset)
#      ;;                                 (yaml-mode . yaml-indent)
#      ;;                                 (sh-mode . sh-basic-offset)
#      ;;                                 (t . 4)))
#     (schrenker/prism-set-colors)
#     (add-hook! '(prog-mode-hook doom-load-theme-hook ns-system-appearance-change-functions) (schrenker/prism-set-colors))))

# #+end_src

* Open very large files effortlessly (thanks Tecosaur)
#+begin_src elisp :tangle packages.el
(package! vlf :recipe (:host github :repo "emacs-straight/vlf" :files ("*.el")) :pin "cacdb359f8c37c6e7e4c7937462b632d22462130")
#+end_src

#+begin_src elisp :tangle config.el
(use-package! vlf-setup
  :defer-incrementally vlf-tune vlf-base vlf-write
  vlf-search vlf-occur vlf-follow vlf-ediff vlf
  :commands vlf vlf-mode
  :init
  (defadvice! +files--ask-about-large-file-vlf (size op-type filename offer-raw)
  "Like `files--ask-user-about-large-file', but with support for `vlf'."
  :override #'files--ask-user-about-large-file
  (if (eq vlf-application 'dont-ask)
      (progn (vlf filename) (error ""))
    (let ((prompt (format "File %s is large (%s), really %s?"
                          (file-name-nondirectory filename)
                          (funcall byte-count-to-string-function size) op-type)))
      (if (not offer-raw)
          (if (y-or-n-p prompt) nil 'abort)
        (let ((choice
               (car
                (read-multiple-choice
                 prompt '((?y "yes")
                          (?n "no")
                          (?l "literally")
                          (?v "vlf"))
                 (files--ask-user-about-large-file-help-text
                  op-type (funcall byte-count-to-string-function size))))))
          (cond ((eq choice ?y) nil)
                ((eq choice ?l) 'raw)
                ((eq choice ?v)
                 (vlf filename)
                 (error ""))
                (t 'abort)))))))
  :config
  (advice-remove 'abort-if-file-too-large #'ad-Advice-abort-if-file-too-large)
  (defvar-local +vlf-cumulative-linenum '((0 . 0))
  "An alist keeping track of the cumulative line number.")

(defun +vlf-update-linum ()
  "Update the line number offset."
  (let ((linenum-offset (alist-get vlf-start-pos +vlf-cumulative-linenum)))
    (setq display-line-numbers-offset (or linenum-offset 0))
    (when (and linenum-offset (not (assq vlf-end-pos +vlf-cumulative-linenum)))
      (push (cons vlf-end-pos (+ linenum-offset
                                 (count-lines (point-min) (point-max))))
            +vlf-cumulative-linenum))))

(add-hook 'vlf-after-chunk-update-hook #'+vlf-update-linum)

;; Since this only works with absolute line numbers, let's make sure we use them.
(add-hook! 'vlf-mode-hook (setq-local display-line-numbers t))

(defun +vlf-next-chunk-or-start ()
  (if (= vlf-file-size vlf-end-pos)
      (vlf-jump-to-chunk 1)
    (vlf-next-batch 1))
  (goto-char (point-min)))

(defun +vlf-last-chunk-or-end ()
  (if (= 0 vlf-start-pos)
      (vlf-end-of-file)
    (vlf-prev-batch 1))
  (goto-char (point-max)))

(defun +vlf-isearch-wrap ()
  (if isearch-forward
      (+vlf-next-chunk-or-start)
    (+vlf-last-chunk-or-end)))

(add-hook! 'vlf-mode-hook (setq-local isearch-wrap-function #'+vlf-isearch-wrap)))
#+end_src

* Additional config

** Load WSL config override
#+begin_src elisp :tangle config.el
(unless IS-MAC
  ;;Start emacs non-maximized
  (setq initial-frame-alist '((top . 1) (left . 1) (width . 120) (height . 40)))
  ;;Unset problematic keybinds
  (map! "M-m" nil))
#+end_src

** Additional tweaks to personal info and org mode for my work
#+begin_src elisp :tangle config.el
(unless IS-MAC
  (load "~/.config/doom/secret/work.el" t t))
#+end_src
