packages.el

(package! treemacs-all-the-icons)

(package! cheat-sh)

(package! inheritenv)

(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))

(package! kele)
